//Определить какой четверти принадлежит точка с координатами (х,у)
let x = 0;
let y = 0;
if (x > 0 && y > 0)
{
    console.log("1-ая четверть координатной плоскости");
}
else if (x < 0 && y > 0)
{
    console.log("2-ая четверть координатной плоскости");
}
else if (x < 0 && y < 0)
{
    console.log("3-я четверть координатной плоскости");
}
else if(x > 0 && y < 0)
{
    console.log("4-ая четверть координатной плоскости");
}
else if(x==0 && y==0)
{
    console.log("Центр координатной плоскости");
}